HelpDesk/src/Catalogs/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Файлы</name>
  <comment>Файлы в папках</comment>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <comment>Владелец файла</comment>
    <type>
      <types>CatalogRef.РазделыБазыЗнаний</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.СтатьиБазыЗнаний</types>
      <types>DocumentRef.Заявка</types>
      <types>CatalogRef.ПапкиФайлов</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <comment>Полное наименование (длиной до 256 символов)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <comment>Пользователь, занявший файл для редактирования</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсия</name>
    <comment>Активная версия</comment>
    <type>
      <types>CatalogRef.ВерсииФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияАвтор</name>
    <comment>Автор - пользователь, создавший версию</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияДатаМодификацииФайла</name>
    <comment>Дата модификации файла - в локальном времени</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияДатаСоздания</name>
    <comment>Дата создания версии</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияКод</name>
    <comment>Текущая версия код</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияНомерВерсии</name>
    <comment>Номер версии</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияРазмер</name>
    <comment>Размер файла версии</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияРасширение</name>
    <comment>Расширение файла версии</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияТом</name>
    <comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <comment>Хранить версии - если Ложь, у файла всегда одна версия - активная</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <comment>Дата заема на редактирование</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

HelpDesk/src/CommonForms/ВыборГиперссылки/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ ФОРМОЙ
&НаКлиенте
Перем мВидСсылки;

&НаКлиенте
Процедура НастроитьФорму()
	
	Элементы.Гиперссылка.Видимость		= (ВидСсылки = 1);
	Элементы.СтатьяБазыЗнаний.Видимость	= (ВидСсылки = 0);
	Элементы.Файл.Видимость	= (ВидСсылки > 1);
	
	Элементы.ГруппаПредставление.Видимость = ДоступностьПредставления;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ВидСсылкиПриИзменении(Элемент)
	Если ВидСсылки = 0 Тогда
		Гиперссылка = "";
		Файл	= Неопределено;
	ИначеЕсли ВидСсылки = 1 Тогда
		СтатьяБазыЗнаний	= Неопределено;
		Файл	= Неопределено;
	ИначеЕсли ВидСсылки = 2 И мВидСсылки <> 2 И мВидСсылки <> Неопределено Тогда
		СтатьяБазыЗнаний	= Неопределено;
		Файл	= Неопределено;
		Гиперссылка = "";
	ИначеЕсли ВидСсылки = 3 И мВидСсылки <> 3 И мВидСсылки <> Неопределено Тогда
		СтатьяБазыЗнаний	= Неопределено;
		Файл	= Неопределено;
		Гиперссылка = "";
	КонецЕсли;
	мВидСсылки = ВидСсылки;	
	НастроитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура СтатьяБазыЗнанийПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.СтатьяБазыЗнаний) Тогда
		//ЭтотОбъект.Гиперссылка = ПолучитьНавигационнуюСсылку(ЭтотОбъект.СтатьяБазыЗнаний);
		ЭтотОбъект.Гиперссылка = "article:" + ЭтотОбъект.СтатьяБазыЗнаний.УникальныйИдентификатор() + "";
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ФОРМЫ
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Список = Элементы.Гиперссылка.СписокВыбора;
	Список.Добавить("http://");
	Список.Добавить("https://");
	Список.Добавить("ftp://");
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ТекЭлем = Элементы.ВидСсылки.СписокВыбора.НайтиПоИдентификатору("1");
		Если ТекЭлем <> Неопределено Тогда
			Элементы.ВидСсылки.СписокВыбора.Удалить(ТекЭлем);
		КонецЕслИ;
	КонецЕсли;
	
	Если Найти(Гиперссылка,"article:") <> 0 Тогда
		ВидСсылки = 0;
		Идентификатор = Сред(Гиперссылка, 9);
		
		Разделитель = СтрНайти(Гиперссылка, "#");
		Если Разделитель > 0 Тогда
			Якорь			= Сред(Идентификатор, Разделитель + 1);
			Идентификатор	= Лев(Идентификатор, Разделитель - 1);
		Иначе 
			Якорь			= "";
		КонецЕсли;
		
		СтатьяБазыЗнаний = БазаЗнанийСервер.ПолучитьСсылкуПоИдентификатору("СтатьиБазыЗнаний", Идентификатор);
	ИначеЕсли Найти(Гиперссылка,"filebase:") <> 0 Тогда
		ВидСсылки = 3;
		Идентификатор = Сред(Гиперссылка, 10);
		
		Разделитель = СтрНайти(Гиперссылка, "#");
		Если Разделитель > 0 Тогда
			Якорь			= Сред(Идентификатор, Разделитель + 1);
			Идентификатор	= Лев(Идентификатор, Разделитель - 1);
		Иначе 
			Якорь			= "";
		КонецЕсли;
		
		Файл = БазаЗнанийСервер.ПолучитьСсылкуПоИдентификатору("Файлы", Идентификатор);
	ИначеЕсли Найти(Гиперссылка,"fileint:") <> 0 Тогда
		ВидСсылки = 2;
		Идентификатор = Сред(Гиперссылка, 9);
		
		Разделитель = СтрНайти(Гиперссылка, "#");
		Если Разделитель > 0 Тогда
			Якорь			= Сред(Идентификатор, Разделитель + 1);
			Идентификатор	= Лев(Идентификатор, Разделитель - 1);
		Иначе 
			Якорь			= "";
		КонецЕсли;
		
		Файл = БазаЗнанийСервер.ПолучитьСсылкуПоИдентификатору("Файлы", Идентификатор)	
	Иначе
		ВидСсылки = 1;
	КонецЕсли;	
	мВидСсылки = ВидСсылки;
	НастроитьФорму();
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьГиперСсылку(Ссылка)
	Если Найти(Ссылка,"article:") = 0 И 
		Найти(Ссылка,"filebase:") = 0 И 
		Найти(Ссылка,"fileint:") = 0 Тогда	
		Если Найти(НРЕГ(Ссылка),"http://") = 0 Тогда
			Ссылка = "http://"+СокрЛ(Ссылка);
		КонецЕсли;
	КонецЕсли;	
	Возврат СокрЛП(Ссылка);	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Отказ = Ложь;

	Если Не ЗначениеЗаполнено(Представление) И ДоступностьПредставления = Истина Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ЗаписатьИЗакрытьЗавершение1", ЭтотОбъект), "Не заполнено представление!");
        Возврат;
	КонецЕсли;
	ЗаписатьИЗакрытьФрагмент1(Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьЗавершение1(ДополнительныеПараметры) Экспорт
	
	Отказ = Истина;
	
	ЗаписатьИЗакрытьФрагмент1(Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьФрагмент1(Знач Отказ)
	
	Если Не ЗначениеЗаполнено(Гиперссылка) Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ЗаписатьИЗакрытьЗавершение", ЭтотОбъект), "Не заполнена ссылка!");
		Возврат;
	КонецЕсли;
	
	ЗаписатьИЗакрытьФрагмент(Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьЗавершение(ДополнительныеПараметры) Экспорт
	
	Отказ = Истина;
	
	ЗаписатьИЗакрытьФрагмент(Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьФрагмент(Знач Отказ)
	
	Перем СтруктураГиперссылки;
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	СтруктураГиперссылки = Новый Структура("Гиперссылка, Представление",
	ПодготовитьГиперСсылку(Гиперссылка),
	Представление);
	
	
	ЭтотОбъект.Закрыть(СтруктураГиперссылки);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
КонецПроцедуры

&НаКлиенте
Процедура ФайлПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ЭтотОбъект.Файл) Тогда
		ЭтотОбъект.Гиперссылка = ?(ВидСсылки=3,"filebase:","fileint:") + ЭтотОбъект.Файл.УникальныйИдентификатор() + "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура();
	Если ВидСсылки = 3 Тогда
		ФормаСписка = ПолучитьФорму("Справочник.Файлы.ФормаВыбора",ПараметрыФормы,Элемент);
	Иначе
		ПараметрыФормы.Вставить("ВладелецФайла",СсылкаНаОбъект);
		ФормаСписка = ПолучитьФорму("Справочник.Файлы.Форма.ФормаВыбораФайлов",ПараметрыФормы,Элемент);
	КонецЕсли;	
	ФормаСписка.ОткрытьМодально();
КонецПроцедуры
